esp-cpp/espp/components/m5stack-tab5/example/sdkconfig.defaults
# ESP32-P4 specific configuration
CONFIG_IDF_TARGET="esp32p4"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Memory configuration
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS configuration
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y

# M5Stack Tab5 BSP configuration
CONFIG_M5STACK_TAB5_INTERRUPT_STACK_SIZE=4096
CONFIG_M5STACK_TAB5_AUDIO_TASK_STACK_SIZE=8192
CONFIG_M5STACK_TAB5_ENABLE_WIRELESS=y
CONFIG_M5STACK_TAB5_ENABLE_CAMERA=y
CONFIG_M5STACK_TAB5_ENABLE_BATTERY_MONITORING=y

# PSRAM configuration
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALLWAYSYINTERNAL=1024

# ESP Timer configuration
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144

# LVGL Configuration
CONFIG_LV_DPI_DEF=160
